{
  "posts" : {
    "0" : {
      "abstract" : " Even as Ricky Danielson and his fellow hunters on Sept. 24 dragged a 576-pound bear 600 yards to some machinery, Wisconsin bear hunters were closing in the DNR’s 2016 bear harvest goal of 4,750 animals.",
      "author" : "Dean Bortzzzz",
      "category" : "",
      "comments" : {
        "-KV6-OxgfP7uYBbCZ7Wn" : true,
        "-KV7Ht_MUsYvhB9h521q" : true,
        "-KV7Hu0SvhPinlrTFQ3Z" : true
      },
      "content" : "Grantsburg, Wis. — Even as Ricky Danielson and his fellow hunters on Sept. 24 dragged a 576-pound bear 600 yards to some machinery, Wisconsin bear hunters were closing in the DNR’s 2016 bear harvest goal of 4,750 animals.\n\nOn Sept. 29, the DNR had a preliminary count of 3,817 registered bears, according to Dave MacFarland, of Rhinelander, the DNR’s bear ecologist.\n\nOn that same date, the DNR also reported that wolves had killed a record 37 dogs so far this year, with seven more dogs injured.\n\n576-pound bear\n\nDanielson, of Grantsburg, has been bear hunting since age 10 or 11. Friends of his family, got him started bear hunting with hounds and he’s been hunting bears ever since.\n\nDanielson has drawn three harvest tags over the years. This third tag went on the 576-pounder (field dressed) that he shot in Zone D in Burnett County. The bear was weighed at the Burnett Area Co-op in Grantsburg. He hunts with the Crex Meadows Bear Hunters group that is headed up by Jerry Burton. The group includes many of Burton’s family members and friends.\n\nThe big bear never showed up on a trail camera, but group members saw its tracks at several bait sites.\n\nThat day the group had four other hunters with kill tags.\n\n“I just was the lucky one in the right spot at the right time,” said Danielson about a long day of bear hunting that began about 7:15 a.m. and ended about 4:30 p.m. when he shot the bear.\n\nThe big boar never treed and never stopped walking. The group started the track with three dogs. The track headed into a big swamp that Danielson said is about three miles by five miles. There are no roads through the swamp. Danielson said the closest the bear came to any road was .6 of a mile – and that’s where he shot it.\n\nThroughout the day, any of the five hunters with kill tags tried closing on the bear in wet, nasty cover.\n\n“It’s a bad swamp. I was up to my waist in mud and water most of the hunt,” he said. “He just stayed in the middle of the swamp and hopped from island to island.”\n\nThe dogs bayed up the bear a number of times throughout the day on those swamp islands. Each time, a tag-bearing hunter tried wading in close enough for a clear shot.\n\n“The first time he stopped I got about 100 yards, but the bear caught my wind. We started pushing it north. Then another couple of hunters came in and got to a bay up, but the bear busted out again,” he said.\n\nLater in the day, Danielson was circling around the swamp on the west side when the bear bayed up again about 400 yards away. That time Danielson got to within 10 yards of the bear.\n\n“It was too thick, but saw it was a big bear. Then it picked up its head, and I was able to shoot it in the chest,” Danielson said.\n\nDanielson used a .45/70 Marlin lever action rifle loaded with Remington 300-grain Core-Lokt bullets.\n\nThat bear was the group’s eighth bear of the season, and the biggest bear so far. Next biggest was a 462-pounder (live weight) that field dressed at 412 pounds. “I passed that one up in a tree a week prior. I knew we had a bigger bear around,” he said.\n\nGroup members joined forces to drag the bear about 600 yards across state land to the edge of private land where farmers let them borrow a John Deere Gator to ferry the bear out of the woods and onto the trucks.\n\nThis is Danielson’s second bear. He didn’t fill his first tag; on the second tag he shot a boar that dressed at 315 pounds. That bear was also shot on ground.\n\nThe dogs included two Plotts, a redbone and three Walkers. Once the first three dogs started the track, two dogs were added. When one dog tired and left the run, they added two more dogs.\n\nBear tally\n\nMacFarland expects the Sept. 29 preliminary harvest of 3,817 bears to continue climbing through the seasons. The bait season closed Oct. 4 in zones A, B and D. The seasons close Oct. in Zone C and for hound hunters in the remaining zones.\n\n“We are about where we’d expect to be at this point,” he said.\n\nThe state’s record bear kill was set in 2010 with 5,133 animals. In 2012, hunters registered 4,646 bears. The 2015 kill was 4,198.\n\nMacFarland said hunters who shot bears last year will begin getting postcards on ages (from last year’s tooth samples) in early December.\n\nMacFarland said Wisconsin bears have reached age 30, but most are much younger. Females have averaged 4.6 years; the males around 3 years old.\n\n“Most bears will be less than 12 years old, there will be a handful in the upper teens and a couple in their 20s. Once or twice in the last 40 years we have had a bear older than 30 years,” he said, adding that the long term average age for both sexes has been pretty stable.\n\nHe said a bear that had been collared every year since it was first collared in 1984 in northwestern Minnesota finally died a year or so ago. It was more than 30 years old when it died.\n\nDogs killed\n\nAs of Oct. 4, 40 dogs have been verified as being killed by wolves, with another seven dogs injured.\n\nMacFarland said that number sets an annual record with 21⁄2 months still left in the year.\n\nThose are losses that have been verified by USDA Wildlife Services staff. Other dogs might have been killed by wolves, but those deaths couldn’t be confirmed by Wildlife Services based on the evidence left at the scene by the time the dog was found and Wildlife Services arrived.\n\nThe previous high was 23 verified dog deaths in 2013, with 20 in 2014 and 22 in 2015.\n\nWhy the increase this year?\n\n“It’s hard to say – anything is speculation. There are more wolves on landscape. We could have more hound hunters on landscape. Hopefully that number will be lower next year,” said MacFarland.\n\nSome have suggested that doing away with the Class B pursuit tag in July 2015 is bringing more nonresident hound hunters to Wisconsin this year, so MacFarland could be correct in suggesting there are more hounds in the woods this year.\n\n“There is no way of knowing since there is no license requirement. The only thing we can track is number of dogs killed that are owned by residents or non-residents,” he said.\n\nThrough Sept. 29, seven of the 37 dogs that had been killed to that point were owned by non-residents.\n\nIn 2015, one dog owned by a non-resident was killed by wolves; there were none the year before.\n\nThe non-resident Class B pursuit tag used to cost $149 per person.\n\nThree more dogs were added to the verified kill list on Oct. 4: a Plott hound killed on Oct. 1 in the town of Winter, Sawyer County; a second Plott killed in separate attack – also on Oct. 1 and in the town of Winter; and a redbone killed on Oct. 1 in the town of Knight, Iron County.",
      "date" : "OCT 13, 2016  ",
      "image" : "http://cincinnatizoo.org/wp-content/uploads/2011/02/connie-lemperle-black-bear-web.jpg",
      "title" : "576-pound black bear among largest in Wisconsin"
    },
    "-KV7DRqeYJVFGSCGCz_l" : {
      "abstract" : "Hunting conditions should be good with wet weather predicted for the opener. Deer populations on the north coast are moderate to abundant, depending on where you hunt.",
      "author" : "Editor",
      "category" : "Huntn",
      "content" : "Deer populations appear to be fairly high related to what we have seen in the past 10 years. As in the recent past, the areas with the highest densities of deer are in southern Coos County and on into Curry County. The best management units in the southern Coast Range will be Sixes, Powers and Chetco Units, however, deer populations are clearly better than in the recent past in the Tioga Unit, as well. Buck ratios in all these units are adequate for a good season. Hunters should use maps to identify areas with water and brushy clear cuts in close proximity to find deer. This was a dry summer on the coast and deer should be attracted areas that provide water as well as good feed. Glassing these areas in early morning and late evening, then stalking in for a shot, will be the most effective technique to use. As the season wears on we will get closer to the beginning of the rut for black-tailed deer. This will cause bucks to become more active and it generally results in the best hunting of the season. Any time storms move on shore and cause wet conditions, deer hunting can be good regardless of the approaching rut. According to weather forecasts rain is expected on the coast during the opening weekend of this season. This may result in opening the season with a bang!",
      "date" : "10/28/2016",
      "image" : "http://localhost:4200/assets/images/huntn.jpg",
      "title" : "WITH RIFLE DEER OPENING THIS SATURDAY"
    },
    "-KV7FxM_tS1W0bm3vynl" : {
      "abstract" : "The famed Buoy 10 is off to a somewhat slow start — at least compared to recent Augusts — but for those who have patience and are willing to stay on the water through a few tide changes the rewards come in big chrome Chinook.",
      "author" : "Editor",
      "content" : "The famed Buoy 10 is off to a somewhat slow start — at least compared to recent Augusts — but for those who have patience and are willing to stay on the water through a few tide changes the rewards come in big chrome Chinook.\\n\\n\n\nEarlier this week we launched out of Astoria to cross the river avoiding sandbars in the predawn light. Jason Hambly threaded his 20-foot jet sled through the maze and found the slot on the Washington side of the river.\\n\\n\n\nStout Cousins Rods designed in Oregon for the Buoy 10 fishery and a Daiwa reel spooled with 65-pound braid kept our 16-ounce dropper weights near the sandy bottom of the river. Behind the dropper was a Yakima Bait Big Al’s Fish Flash and a 25-pound leader to a cut-plug herring that Hambly had cured overnight using Pro-Cure Brine-n-Bite Complete, as well as Anise Oil.\\n\\n\n\nFive hours later, with no fish in our boat and very few nets being waved we decided to head to the Oregon side. It was a rough ride across as the tide had flushed back in and covered the sand bars.\\n\\n\n\nSoon we were trolling alongside the anchored cargo ships. It didn’t take long before we finally had a bite, but that fish didn’t stick. Then, Ryan, my 10-year-old son — who had somehow slept most of the morning in the rough water — woke from his nap just in time to see his rod load up and bury into the river. A smaller but still bright Chinook came to the net.\\n\\n\n\nFive hours later, with no fish in our boat and very few nets being waved we decided to head to the Oregon side. It was a rough ride across as the tide had flushed back in and covered the sand bars.\\n\\n\n\nSoon we were trolling alongside the anchored cargo ships. It didn’t take long before we finally had a bite, but that fish didn’t stick. Then, Ryan, my 10-year-old son — who had somehow slept most of the morning in the rough water — woke from his nap just in time to see his rod load up and bury into the river. A smaller but still bright Chinook came to the net.\\n\\n\n\nFive hours later, with no fish in our boat and very few nets being waved we decided to head to the Oregon side. It was a rough ride across as the tide had flushed back in and covered the sand bars.\\n\\n\n\nSoon we were trolling alongside the anchored cargo ships. It didn’t take long before we finally had a bite, but that fish didn’t stick. Then, Ryan, my 10-year-old son — who had somehow slept most of the morning in the rough water — woke from his nap just in time to see his rod load up and bury into the river. A smaller but still bright Chinook came to the net.\\n\\n\n\nThen Jason Hambly’s rod pinned to the side of the boat and we knew we had finally hooked a big fish! Fighting it for what seemed forever in the washtub water as the boat rocked back and forth, Dave got the net under the massive fish. Silver-sided with a hue of blue and purple and a spackled black back, it was a prime example of why anglers endure the rough waters of Buoy 10.\\n\\n\n\nAnother pass and this time, finally my rod bent over and I fought a respectable fish to the boat.\\n\\n\n\nWe had been on the water for 10 hours and after netting my fish we realized there was nobody else on the river. We decided to call it a day, and though Dave didn’t punch his card on a Buoy 10 Chinook he was all smiles once we got back to the harbor.\\n\\n\n\nAs we filleted our fish in the cleaning room we learned that out of all of the boats we talked to on the river we had done the best, with five fish landed. Jarrod Higginbotham of Yakima Bait Company was just pulling his boat off of the ramp as we walked to our trucks carrying the bags of salmon. He confirmed that staying on the water and “grinding it out” is what it takes to catch Buoy 10 fish this year, as his son Hunter pulled a 22-pound slab of a Chinook out of the fish box. Jarrod told us that herring works well, but this one had fallen to a spinner behind a Big Al’s.\\n\\n\n\nEditor’s note: Chinook retention at Buoy 10 is scheduled to remain open through Labor Day, but remember that only hatchery kings can be retained on Sundays and Mondays, an effort to keep the Chinook fishery from having to close early like past seasons.\\n\\n",
      "date" : "10/10/2016",
      "image" : "http://i2.wp.com/nwsportsmanmag.com/wp-content/uploads/2016/08/DSC_2134-3-min.jpg?resize=672%2C372",
      "title" : "GRINDING IT OUT’ KEY TO SUCCESS THIS WEEK AT BUOY 10"
    },
    "-KV7HnF-w8PriE2w3o9N" : {
      "author" : "Harambe",
      "category" : "",
      "content" : "Cincinnati, Ohio.- A totally innocent man took his dick out as a sign of respect for the almighty Harambe, who died unfairly on May 28 of the present year. But feminists around the area didn’t like this. They thought that he was provoking them, and that it was a sexist sign of superiority allowed by the patriarchy.\\n\\n\n\n4 feminists suddenly appeared and started hitting the poor man, without leaving him to get his pants up. He tried to defend himself but they hit him again and yelled at him saying “You cannot hit a woman!“. Finally, the man was knocked out and taken to a hospital.\\n\\n\n\nThe women were congratulated for being strong and independent and the man is recovering in the hospital “Dr. Gary Cockburn”, where he is yelling at the doctors saying “I’m coming Harambe!!!” and trying to convince them to show some respect for Harambe.\\n\\n\n\nWe encourage you to show some respect only if you’re far away from angry feminists. Remember what Harambe used to say about feminism.\\n\\n",
      "image" : "http://i2.mirror.co.uk/incoming/article8075004.ece/ALTERNATES/s615b/Harambe.jpg",
      "title" : "Dicks Out For Harmabe"
    }
  }
}
