{ "posts": [
  {
    "title": "576-pound black bear among largest in Wisconsin",
    "author": "Dean Bortz",
    "abstract": " Even as Ricky Danielson and his fellow hunters on Sept. 24 dragged a 576-pound bear 600 yards to some machinery, Wisconsin bear hunters were closing in the DNR’s 2016 bear harvest goal of 4,750 animals.",
    "content": "Grantsburg, Wis. — Even as Ricky Danielson and his fellow hunters on Sept. 24 dragged a 576-pound bear 600 yards to some machinery, Wisconsin bear hunters were closing in the DNR’s 2016 bear harvest goal of 4,750 animals.\n\nOn Sept. 29, the DNR had a preliminary count of 3,817 registered bears, according to Dave MacFarland, of Rhinelander, the DNR’s bear ecologist.\n\nOn that same date, the DNR also reported that wolves had killed a record 37 dogs so far this year, with seven more dogs injured.\n\n576-pound bear\n\nDanielson, of Grantsburg, has been bear hunting since age 10 or 11. Friends of his family, got him started bear hunting with hounds and he’s been hunting bears ever since.\n\nDanielson has drawn three harvest tags over the years. This third tag went on the 576-pounder (field dressed) that he shot in Zone D in Burnett County. The bear was weighed at the Burnett Area Co-op in Grantsburg. He hunts with the Crex Meadows Bear Hunters group that is headed up by Jerry Burton. The group includes many of Burton’s family members and friends.\n\nThe big bear never showed up on a trail camera, but group members saw its tracks at several bait sites.\n\nThat day the group had four other hunters with kill tags.\n\n“I just was the lucky one in the right spot at the right time,” said Danielson about a long day of bear hunting that began about 7:15 a.m. and ended about 4:30 p.m. when he shot the bear.\n\nThe big boar never treed and never stopped walking. The group started the track with three dogs. The track headed into a big swamp that Danielson said is about three miles by five miles. There are no roads through the swamp. Danielson said the closest the bear came to any road was .6 of a mile – and that’s where he shot it.\n\nThroughout the day, any of the five hunters with kill tags tried closing on the bear in wet, nasty cover.\n\n“It’s a bad swamp. I was up to my waist in mud and water most of the hunt,” he said. “He just stayed in the middle of the swamp and hopped from island to island.”\n\nThe dogs bayed up the bear a number of times throughout the day on those swamp islands. Each time, a tag-bearing hunter tried wading in close enough for a clear shot.\n\n“The first time he stopped I got about 100 yards, but the bear caught my wind. We started pushing it north. Then another couple of hunters came in and got to a bay up, but the bear busted out again,” he said.\n\nLater in the day, Danielson was circling around the swamp on the west side when the bear bayed up again about 400 yards away. That time Danielson got to within 10 yards of the bear.\n\n“It was too thick, but saw it was a big bear. Then it picked up its head, and I was able to shoot it in the chest,” Danielson said.\n\nDanielson used a .45/70 Marlin lever action rifle loaded with Remington 300-grain Core-Lokt bullets.\n\nThat bear was the group’s eighth bear of the season, and the biggest bear so far. Next biggest was a 462-pounder (live weight) that field dressed at 412 pounds. “I passed that one up in a tree a week prior. I knew we had a bigger bear around,” he said.\n\nGroup members joined forces to drag the bear about 600 yards across state land to the edge of private land where farmers let them borrow a John Deere Gator to ferry the bear out of the woods and onto the trucks.\n\nThis is Danielson’s second bear. He didn’t fill his first tag; on the second tag he shot a boar that dressed at 315 pounds. That bear was also shot on ground.\n\nThe dogs included two Plotts, a redbone and three Walkers. Once the first three dogs started the track, two dogs were added. When one dog tired and left the run, they added two more dogs.\n\nBear tally\n\nMacFarland expects the Sept. 29 preliminary harvest of 3,817 bears to continue climbing through the seasons. The bait season closed Oct. 4 in zones A, B and D. The seasons close Oct. in Zone C and for hound hunters in the remaining zones.\n\n“We are about where we’d expect to be at this point,” he said.\n\nThe state’s record bear kill was set in 2010 with 5,133 animals. In 2012, hunters registered 4,646 bears. The 2015 kill was 4,198.\n\nMacFarland said hunters who shot bears last year will begin getting postcards on ages (from last year’s tooth samples) in early December.\n\nMacFarland said Wisconsin bears have reached age 30, but most are much younger. Females have averaged 4.6 years; the males around 3 years old.\n\n“Most bears will be less than 12 years old, there will be a handful in the upper teens and a couple in their 20s. Once or twice in the last 40 years we have had a bear older than 30 years,” he said, adding that the long term average age for both sexes has been pretty stable.\n\nHe said a bear that had been collared every year since it was first collared in 1984 in northwestern Minnesota finally died a year or so ago. It was more than 30 years old when it died.\n\nDogs killed\n\nAs of Oct. 4, 40 dogs have been verified as being killed by wolves, with another seven dogs injured.\n\nMacFarland said that number sets an annual record with 21⁄2 months still left in the year.\n\nThose are losses that have been verified by USDA Wildlife Services staff. Other dogs might have been killed by wolves, but those deaths couldn’t be confirmed by Wildlife Services based on the evidence left at the scene by the time the dog was found and Wildlife Services arrived.\n\nThe previous high was 23 verified dog deaths in 2013, with 20 in 2014 and 22 in 2015.\n\nWhy the increase this year?\n\n“It’s hard to say – anything is speculation. There are more wolves on landscape. We could have more hound hunters on landscape. Hopefully that number will be lower next year,” said MacFarland.\n\nSome have suggested that doing away with the Class B pursuit tag in July 2015 is bringing more nonresident hound hunters to Wisconsin this year, so MacFarland could be correct in suggesting there are more hounds in the woods this year.\n\n“There is no way of knowing since there is no license requirement. The only thing we can track is number of dogs killed that are owned by residents or non-residents,” he said.\n\nThrough Sept. 29, seven of the 37 dogs that had been killed to that point were owned by non-residents.\n\nIn 2015, one dog owned by a non-resident was killed by wolves; there were none the year before.\n\nThe non-resident Class B pursuit tag used to cost $149 per person.\n\nThree more dogs were added to the verified kill list on Oct. 4: a Plott hound killed on Oct. 1 in the town of Winter, Sawyer County; a second Plott killed in separate attack – also on Oct. 1 and in the town of Winter; and a redbone killed on Oct. 1 in the town of Knight, Iron County.",
    "date": "OCT 13, 2016",
    "image": "http://cincinnatizoo.org/wp-content/uploads/2011/02/connie-lemperle-black-bear-web.jpg",
    "tags": "",
    "category": ""
  },

  {
    "title": "HERO TAKES LSD, RESCUES DOG FROM BURNING HOUSE THAT WASN'T ON FIRE",
    "author": "STEVE HUFF",
    "abstract": "It's simpler than it sounds.",
    "content": "Some heroes are meant for the time in which they're born. Some trip on LSD with cough syrup then drive their car through a fence and force their way into a burning home to rescue a dog. That's what police say 43-year-old Michael Orchard of Halfmoon New York did recently. The problem was the house wasn't on fire and the dog was just fine.\n\nNew York State Trooper Mark Cepiel confirmed to local news that Orchard had indeed consumed a mindbending cocktail of substances and believed that the residence was on fire and he was rescuing the dog.",
    "date": "OCT 16, 2016",
    "image": "http://a5.files.maxim.com/image/upload/c_fit,cs_srgb,dpr_1.0,q_80,w_620/MTQyMjYxNTY2NjI3MTI5MTcz.jpg",
    "tags": "",
    "category": ""
  },
{
    "title": "A CREEPY CLOWN PRANKSTER GOT BLOWN TO BITS AFTER BEING CHASED ONTO A LANDMINE",
    "author": "STEVE HUFF",
    "abstract": "Let this be a warning to all the creepy clowns out there.",
    "content": "Clown hysteria has gone worldwide. That's bad enough, but up till now it's only taken a few casualties, including the public's supposed goodwill toward Ronald McDonald. Insane Clown Posse's Violent J has spoken out about it. No less than clown horror godfather Stephen King has addressed the issue. Now, from Cambodia, comes this tragic tale. It begins with a clown and ends with a land mine. \n\nThe U.K. tabloid Mirror cites The Times of Cambodia in reporting on an incident that allegedly occurred in Samraong in the northwestern part of the country. A 25-year-old American student reportedly visiting relatives there made the mistake of donning a creepy clown mask. Things went horribly downhill from there:\n\nCambodia has been at war for decades and is riddled with landmines—they are a real, daily danger there, and the country has thousands of amputees bearing witness to their toll. The unnamed man whose clown mask prompted his unfortunate flight apparently didn't make it out merely maimed.\n\nIt might be easy to take this tragic story with a grain of salt due to its vagueness and the sketchy, tabloid source. However even as weird reports of lurking clown-masked strangers have receded a little from U.S. news, there have been reports of floppy-shoed, rubber-nosed menacing in Germany and bans in towns and school systems on clown costumes.",
    "date": "OCT 21, 2016",
    "image": "http://a1.files.maxim.com/image/upload/c_fit,cs_srgb,dpr_1.0,q_80,w_620/MTQyMzc0NzgwODkxMzA5MTU5.jpg",
    "tags": "",
    "category": ""
  },
{
    "title": "Jon Jones’ Attorney Says USADA Has Confirmed Product He Took Was Contaminated",
    "author": "Matt Boone",
    "abstract": "According to Jon Jones’ attorney, Howard Jacobs, former UFC Light Heavyweight Champion Jon Jones could be standing inside an Octagon again a lot sooner than it seemed like he would.",
    "content": "According to Jon Jones’ attorney, Howard Jacobs, former UFC Light Heavyweight Champion Jon Jones could be standing inside an Octagon again a lot sooner than it seemed like he would. \n\nJacobs appeared as a guest on the The Luke Thomas Show recently and spoke about what the Jones camp expects in terms of seeing out the process related to his questionable USADA Anti-Doping Policy violation back at UFC 200 in July.  “Bones” Jones faces his arbitration hearing with the Nevada Athletic Commission (NAC) on October 31st, where he could be looking at as much as a one-year suspension or as little as no suspension.",
    "date": "OCT 24, 2016",
    "image": "http://a.fssta.com/content/dam/fsdigital/fscom/ufc/images/2016/10/25/102516-UFC-Jon-Jones-1.vadapt.980.high.21.jpg",
    "tags": "",
    "category": ""
  },
{
    "title": "The lightest ballistic helmet on the market | the Delta X from Safariland Group",
    "author": "Sofrep",
    "abstract": "I heard my ruck hit below me which gave me little less than a second before I impacted. A sudden gust of wind caught me and I landed cross-wind. In the blur of impacts that followed my head hit a rock",
    "content": "There was a wild squeal as gears shifted before the ramp to the C-130J opened, my peltors clicked out for a moment blocking the sound and all at once I felt the pressure change against my skin and deep inside my ears. The loud drone of the engines filled the inside of the aircraft as our eyes adjusted to the sunlight. The late afternoon sun burned away the darkness and illuminated us clad in Crye multicams with MC-6 static line parachutes on our backs and 50 pounds rucks hanging between our legs. The ramp opened fully and I could clearly see the ground flashing by 1250 feet beneath us as the C-130J slowed to a snail’s pace of 130 knots. I held my static line firmly as the Jumpmaster gave us the stand-by signal. The light turned from no-go to green go, “GO GO GO!” he gave the first jumper a solid slap on the ass, the first jumper walked off the edge of the ramp and we all followed. \n\nI felt the familiar rush as I dropped from the C-130J, the gusts of wind quickly faded as my parachute inflated until the only sounds I could hear were the soft rustles of my parachute in the wind against the late October sky and my ruck creaking beneath me. I quickly tested the steering on my parachute to ensure my risers were working before I turned myself towards the designated landing area. 1 minute or so later and I was at 200 feet above ground level. I looked down and grasped my ruck’s release tab and pulled up, it released with a soft whoosh of Velcro and fell then stopped as my lowering line arrested its fall. So far so good. I steered my parachute into the wind and prepared for impact. I heard my ruck hit below me which gave me little less than a second before I impacted. A sudden gust of wind caught me and I landed cross-wind. In the blur of impacts that followed my head hit a rock.\n\nI stood up, somewhat dazed, and gave the medics a thumbs up. I then continued for the rest of my mission. When it comes to hard impacts on ballistic helmet you want to be sure your helmet can take them and still retain full ballistic integrity. I had no qualms as I was wearing the Safariland Group Protech Tactical Delta X helmet. When working in non-permissive environments you expect a lot from your helmet. It needs to be light, have the highest fragmentation protection possible, and be able to stop type IIIA handgun threats. Most ballistic helmets do the latter. Fewer do frag and IIIA threats. And it gets narrowed down to a couple when it comes to being lightweight. The Delta X shell weighs a mere 1.26 lbs, and with suspension, rails, shroud and pads it comes in at 2.2 lbs. Compare this to most other high-cut helmets which weigh in around 2.4-2.8 lbs complete. This puts it as the lightest helmet meeting the above standards on the market as of this writing.",
    "date": "OCT 24, 2016",
    "image": "https://sofrep.com/wp-content/uploads/2016/10/HELMET2-834x626.jpg",
    "tags": "",
    "category": ""
  },
{
    "title": "Is ben cool?",
    "author": "Benviss",
    "abstract": "I heard this kid named ben was super cool",
    "content": "I heard this kid named ben was super cool, \"its true he is,\" said one source but it was later determined that the source was smoking mass quantities of crack and was not a credible source.  Also he dont hunt'nfish!!!",
    "date": "OCT 24, 2016",
    "image": "http://orig07.deviantart.net/3380/f/2008/304/8/e/pedo_bear_mask_by_bltsalade.jpg",
    "tags": "",
    "category": ""
  }
]
}
